{
  "backend/main.mo": "Empty Motoko actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind base layer defining design tokens, theme variables, and dark‑mode overrides.",
  "frontend/index.html": "HTML entry point containing the root div and script to load the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps all pages in the AppLayout.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapper providing navy background and heart animation with centered content.",
  "frontend/src/components/GlassCard.tsx": "Reusable glass‑style card component supporting extra HTML div attributes.",
  "frontend/src/components/HeartsBackground.tsx": "Generates floating and falling animated blue heart elements across the viewport.",
  "frontend/src/components/PageTransition.tsx": "Simple wrapper applying a fade‑in animation to page content.",
  "frontend/src/components/PrimaryButton.tsx": "Styled primary/secondary button component with glow and hover effects.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on the current identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and hooks for managing Internet Identity login and stored identities.",
  "frontend/src/index.css": "Tailwind styles with extended Valentine blue theme, utilities, and glow effects.",
  "frontend/src/lib/utils.ts": "Utility function merging Tailwind class names using clsx and tailwind‑merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ForeverPage.tsx": "Displays a romantic 'Forever' page with glowing heart visuals, messages, and animated floating hearts.",
  "frontend/src/pages/GiftsHubPage.tsx": "Shows a hub of gift options linking to quiz, letter, and gallery pages, with a button leading to the Forever page.",
  "frontend/src/pages/LoveLetterPage.tsx": "Provides a love letter viewer and editor with localStorage persistence and edit/save/cancel functionality.",
  "frontend/src/pages/LoveQuizPage.tsx": "Implements an interactive multi-question love quiz with navigation, scoring, and result messages.",
  "frontend/src/pages/PhotoGalleryPage.tsx": "Manages a customizable photo gallery with upload, captions, editing, reset options, and localStorage storage.",
  "frontend/src/pages/ProposalPage.tsx": "Shows a playful Valentine proposal with an enlarging Yes button and an evasive No button leading to a success page.",
  "frontend/src/pages/TransitionPage.tsx": "Displays a brief transition screen before auto-navigating to the gifts page.",
  "frontend/src/utils/imageToBase64.ts": "Converts image files to base64 strings with type and size validation.",
  "frontend/src/utils/localStorage.ts": "Provides safe wrapper functions for reading and writing JSON data to localStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH color palette, container settings, animations, and extended theme utilities for a navy/blue visual style.",
  "project_state.json": "Defines the project’s state, feature list, architecture notes, and visual/functional requirements for a multi-page Valentine-themed website."
}